
// Event module অর্থ হলো এমন একটি ব্যবস্থা বা কোডের অংশ, যেটা ঘটনা (event) পরিচালনা করে। কোনো প্রোগ্রামে যখন একটি নির্দিষ্ট কাজ ঘটে—যেমন: ব্যবহারকারী কোনো বাটনে ক্লিক করে, কিবোর্ড চাপ দেয়, বা সার্ভার থেকে ডেটা আসে—তখন সেটাকে event বলা হয়। আর এই ইভেন্টগুলোকে ধরার ও পরিচালনার জন্য যেটা ব্যবহার করা হয়, সেটাই event module।

// Node.js-এ একটা বিল্ট-ইন module আছে যার নাম events। এটি দিয়ে তুমি ইভেন্ট তৈরি করতে পারো এবং সেই ইভেন্ট ঘটলে (trigger হলে) কী হবে তা নির্ধারণ করতে পারো।

// কেন Event Module ব্যবহার করা হয়? অ্যাসিনক্রোনাস (asynchronous) বা একসাথে একাধিক কাজ করতে সহায়তা করে। ইভেন্ট-ভিত্তিক প্রোগ্রামিং সহজ করে তোলে। রিয়েল-টাইম অ্যাপ বা বড় প্রজেক্টে event-driven মডেল খুবই কার্যকর।

const EventEmitter = require("node:events");

class SchoolBell extends EventEmitter {}

const bell = new SchoolBell();

bell.on("ring", () => {
  console.log("Class ses");
});

bell.emit("ring");


